test/fixtures/jmeter/timer-assertion-matrix.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Timer Assertion Matrix" enabled="true"/>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Threads" enabled="true">
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
      </ThreadGroup>
      <hashTree>
        <PreciseThroughputTimer guiclass="TestBeanGUI" testclass="PreciseThroughputTimer" testname="Precise Arrival" enabled="true">
          <stringProp name="throughput">30</stringProp>
          <stringProp name="throughputPeriod">60</stringProp>
        </PreciseThroughputTimer>
        <hashTree/>
        <PoissonRandomTimer guiclass="TestBeanGUI" testclass="PoissonRandomTimer" testname="Poisson Pause" enabled="true">
          <stringProp name="RandomTimer.range">250</stringProp>
          <stringProp name="ConstantTimer.delay">75</stringProp>
        </PoissonRandomTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Matrix Request" enabled="true">
          <stringProp name="HTTPSampler.domain">matrix.example.test</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/matrix</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion enabled="false" testname="Header Message">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="accepted">accepted</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_message</stringProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion enabled="false" testname="Disabled Duration">
            <stringProp name="DurationAssertion.duration">250</stringProp>
          </DurationAssertion>
          <hashTree/>
          <SizeAssertion enabled="false" testname="Disabled Size">
            <stringProp name="SizeAssertion.size">2048</stringProp>
            <stringProp name="SizeAssertion.operator">3</stringProp>
          </SizeAssertion>
          <hashTree/>
          <JSONPathAssertion enabled="false" testname="Disabled JSON Path">
            <stringProp name="JSON_PATH">$.matrix.id</stringProp>
            <stringProp name="EXPECTED_VALUE">m1</stringProp>
          </JSONPathAssertion>
          <hashTree/>
          <HTMLAssertion guiclass="HTMLAssertionGui" testclass="HTMLAssertion" testname="HTML Validity" enabled="true">
            <stringProp name="doctype">omit</stringProp>
            <stringProp name="errorsonly">true</stringProp>
          </HTMLAssertion>
          <hashTree/>
          <XMLSchemaAssertion guiclass="XMLSchemaAssertionGUI" testclass="XMLSchemaAssertion" testname="Schema Check" enabled="true">
            <stringProp name="xmlschema_assertion_filename">schema.xsd</stringProp>
          </XMLSchemaAssertion>
          <hashTree/>
          <CompareAssertion guiclass="CompareAssertionGui" testclass="CompareAssertion" testname="Compare Previous" enabled="false">
            <stringProp name="CompareAssertion.compareContent">true</stringProp>
          </CompareAssertion>
          <hashTree/>
          <SMIMEAssertion guiclass="SMIMEAssertionGui" testclass="SMIMEAssertion" testname="Signed MIME" enabled="true">
            <stringProp name="SMIMEAssertion.verifySignature">true</stringProp>
          </SMIMEAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>